stm32-rs/stm32f3xx-hal/src/pwm.rs
// TIM3

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f373", feature = "stm32f378", feature = "stm32f334", feature = "stm32f328", feature = "stm32f358", feature = "stm32f398"))]
macro_rules! tim3_common {
    () => {
        use crate::stm32::TIM3;

        pub struct TIM3_CH1 {}
        pub struct TIM3_CH2 {}
        pub struct TIM3_CH3 {}
        pub struct TIM3_CH4 {}

        pwm_timer_basic!(
            tim3,
            TIM3,
            u16,
            apb1enr,
            pclk1,
            tim3en,
            [TIM3_CH1,TIM3_CH2,TIM3_CH3,TIM3_CH4],
            [PwmChannel,PwmChannel,PwmChannel,PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM3, TIM3_CH1, u16, cc1e, ccr1, ccr);
        pwm_pin_for_pwm_channel!(TIM3, TIM3_CH2, u16, cc2e, ccr2, ccr);
        pwm_pin_for_pwm_channel!(TIM3, TIM3_CH3, u16, cc3e, ccr3, ccr);
        pwm_pin_for_pwm_channel!(TIM3, TIM3_CH4, u16, cc4e, ccr4, ccr);

        // Pins
        pwm_channel_pin!(WithPins, TIM3, TIM3_CH1, output_to_pa6, PA6, AF2, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM3, TIM3_CH1, output_to_pb4, PB4, AF2, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH2, output_to_pa4, PA4, AF2, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM3, TIM3_CH2, output_to_pa7, PA7, AF2, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM3, TIM3_CH2, output_to_pb5, PB5, AF2, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH3, output_to_pb0, PB0, AF2, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH4, output_to_pb1, PB1, AF2, ccmr2_output, oc4m, oc4pe);
        pwm_channel_pin!(WithPins, TIM3, TIM3_CH4, output_to_pb7, PB7, AF10, ccmr2_output, oc4m, oc4pe);
    }
}

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f373", feature = "stm32f378", feature = "stm32f334", feature = "stm32f358", feature = "stm32f398"))]
macro_rules! tim3_ext1 {
    () => {
        pwm_channel_pin!(WithPins, TIM3, TIM3_CH1, output_to_pc6, PC6, AF2, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH2, output_to_pc7, PC7, AF2, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH3, output_to_pc8, PC8, AF2, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH4, output_to_pc9, PC9, AF2, ccmr2_output, oc4m, oc4pe);
    }
}

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
macro_rules! tim3_ext2 {
    () => {
        pwm_channel_pin!(WithPins, TIM3, TIM3_CH1, output_to_pe2, PE6, AF2, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH2, output_to_pe3, PE7, AF2, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH3, output_to_pe4, PE8, AF2, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM3, TIM3_CH4, output_to_pe5, PE9, AF2, ccmr2_output, oc4m, oc4pe);
    }
}


#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f373", feature = "stm32f378", feature = "stm32f334", feature = "stm32f328", feature = "stm32f358", feature = "stm32f398"))]
tim3_common!();

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f373", feature = "stm32f378", feature = "stm32f334", feature = "stm32f358", feature = "stm32f398"))]
tim3_ext1!();

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
tim3_ext2!();

#[cfg(feature = "stm32f373")]
pwm_channel_pin!(WithPins, TIM3, TIM3_CH2, output_to_pb0, PB0, AF10, ccmr1_output, oc2m, oc2pe);

#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
pwm_channel_pin!(WithPins, TIM3, TIM3_CH3, output_to_pb6, PB6, AF10, ccmr2_output, oc3m, oc3pe);


// TIM4

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f373", feature = "stm32f378", feature = "stm32f358", feature = "stm32f398"))]
macro_rules! tim4 {
    () => {
        use crate::stm32::TIM4;

        pub struct TIM4_CH1 {}
        pub struct TIM4_CH2 {}
        pub struct TIM4_CH3 {}
        pub struct TIM4_CH4 {}

        pwm_timer_basic!(
            tim4,
            TIM4,
            u16,
            apb1enr,
            pclk1,
            tim4en,
            [TIM4_CH1,TIM4_CH2,TIM4_CH3,TIM4_CH4],
            [PwmChannel,PwmChannel,PwmChannel,PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM4, TIM4_CH1, u16, cc1e, ccr1, ccr);
        pwm_pin_for_pwm_channel!(TIM4, TIM4_CH2, u16, cc2e, ccr2, ccr);
        pwm_pin_for_pwm_channel!(TIM4, TIM4_CH3, u16, cc3e, ccr3, ccr);
        pwm_pin_for_pwm_channel!(TIM4, TIM4_CH4, u16, cc4e, ccr4, ccr);

        // Pins
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH1, output_to_pa11, PA11, AF10, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH1, output_to_pb6, PB6, AF2, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH1, output_to_pd12, PD12, AF2, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM4, TIM4_CH2, output_to_pa12, PA12, AF10, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH2, output_to_pb7, PB7, AF2, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH2, output_to_pd13, PD13, AF2, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM4, TIM4_CH3, output_to_pa13, PA13, AF10, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH3, output_to_pb8, PB8, AF2, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH3, output_to_pd14, PD14, AF2, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM4, TIM4_CH4, output_to_pb9, PB9, AF2, ccmr2_output, oc4m, oc4pe);
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH4, output_to_pd15, PD15, AF2, ccmr2_output, oc4m, oc4pe);
        pwm_channel_pin!(WithPins, TIM4, TIM4_CH4, output_to_pf6, PF6, AF2, ccmr2_output, oc4m, oc4pe);
    }
}

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f373", feature = "stm32f378", feature = "stm32f358", feature = "stm32f398"))]
tim4!();


// TIM5

